In [11]:
import pandas as pd

movies = [{"Title": "Hi", "Rating": 5}, {"Title": "No", "Rating": 3}]
movies
df_movies = pd.DataFrame(movies)

In [12]:
df_movies

  Title  Rating
0    Hi       5
1    No       3

In [13]:
df_movies.describe()

         Rating
count  2.000000
mean   4.000000
std    1.414214
min    3.000000
25%    3.500000
50%    4.000000
75%    4.500000
max    5.000000

In [14]:
df_movies.head()

  Title  Rating
0    Hi       5
1    No       3

In [16]:
df_movies["Title"]

0    Hi
1    No
Name: Title, dtype: object

In [18]:
df_movies["Rating"].mean()

4.0

In [19]:
df_movies["Rating"].sum()

8

In [20]:
df_movies["Rating"].unique()

array([5, 3], dtype=int64)

In [21]:
df_movies.value_counts()

Title  Rating
Hi     5         1
No     3         1
dtype: int64

In [22]:
df_movies["Rating"]*100

0    500
1    300
Name: Rating, dtype: int64